package com.example.qiuxiexianweijing.bean;

import com.example.qiuxiexianweijing.R;

public class Shoes {
    private String[] nikeTexts ={
            "球鞋简介: \n"+
                    "LeBron 第一14个做的事情就是用魔术贴绑带来固定双脚在鞋内的位置。但是最初魔术贴绑带被用来固定脚踝，到现在魔术贴被放在脚背的部分，让固定的区域发生改变，保证整体的稳定度。将鸡蛋清和淀粉调料调匀  \n" +
                    "第一层也就是最外面一层，在网布层也叠加了一层大面积透气孔的泡棉，在保证支撑的时候，也并不放弃透气性。\n" +
                    "最后一层就是内靴部分了。作为最贴近双脚的部分，所以内靴部分使用了柔软顺滑的尼龙布材料，保证舒适。\n"+
                    "\n"+
                    "\n"+
                    "球鞋测评: \n"+
                    "鞋码貌似稍微偏大 要穿厚袜子才能感觉到包裹性 鞋后的鞋提起了很大的作用....如果没有的话我还真不知道怎么穿进去 有的人说穿上很费劲 我觉得这和战士10差不多。",

            "球鞋简介: \n" +
                    "科比的低帮篮球鞋的设计灵感源自令人意想不到的地方：足球场。科比说道，“他们对足部和踝部的要求与我在篮球场上所做的动作并无二致，而且所有这些顶尖足球队员都是穿着低帮球鞋。 \n" +
                    "“我观看了许多场足球比赛，我也目睹了许多世界顶尖足球运动员穿着轻质的低帮球鞋进行灵活切位和高速跑动, \n" +
                    "nikezoomkobeV（耐克科比V代）篮球鞋是耐克公司与NBA篮球巨星科比·布莱恩特签约后为其推出的第三款个人签名明星款式篮球鞋。\n" +
                    "这款nikezoomkobeVII篮球鞋也是整个耐克科比系列中科比·布莱恩特最钟爱的一款。 \n"+
                    "\n"+
                    "\n"+
                    "球鞋测评: \n"+
                    "MVP版本选用了zoomkobe3的smoothleather款，白色鞋身附以中底处环绕的黄色线条，简洁而不失活力，鞋舌处由“MVP”字样组成的特别徽章更是整鞋的灵魂所在。\n",

            "球鞋简介: \n" +
                   "5代 NIKE KYRIE IRVING 篮球鞋。鞋盒内置芯片，原厚度ZOOM TURBO气垫。超含胶率大底，区分纸片气垫。耐磨可同日而语，鞋底蓝色欧文标志。\n "+
                   "左右不同，原档无色差鞋面图案。前掌正确双注胶孔，正确原鞋盒。菠萝叶正确Flytrap高频鞋舌图案。\n"+
                    "\n"+
                    "\n"+
                    "球鞋测评: \n"+
                    "专为突破打造的特殊设计 \n" +
                    "为了满足欧文这类突破型球员的特殊要求，欧文系列一直有不少专为启动突破打造的特殊设计。继承了前几代的弧形鞋底，配合首次搭载的 Zoom Turbo 气垫，确实有如涡轮增压一般，提供强劲推动感，让你启动第一步动力十足。\n",

            "球鞋简介: \n" +
                    "而这双堆料的zoom gt cut 在刚开始折扣的情况下，已经成为了一双高出原价的实战鞋，这在往常真的想都不敢想。\n "+
                    "其实大部分原因就是在于这双GT cut无论是实战还是配置都是近年耐克的一双巅峰实战好鞋，同时这样的鞋型一定会让很多老鞋迷想到og的zk系列。\n "+
                    "\n"+
                    "\n"+
                    "球鞋测评: \n"+
                    "整双鞋的鞋楦其实是偏窄的，脚也是42.5的。\n "+
                    "穿上这双鞋以后，瘦脚的他拉紧鞋带后包裹很好。感受在于鞋面包裹在鞋头上方的位置和前方是余量的。",

            "球鞋简介: \n" +
                    "LeBron 16延续了LeBron 15搭载的革新Max Air缓震气垫。中底缓震的配置上有所提高。一体式的Max Air缓震气垫，看到这个气垫是绝对的给力呀，在鞋身重量方面有了一个很大的提高。可以这样说lbj16在防侧翻的能力上肯定是有所提升的lbj6在鞋面的包裹上也是进一步提升，\n" +
                    "LeBron 16取消了前掌和气垫之间的连接，取而代之的是一种支架结构，这样可以减轻鞋身重量并提供额外的支撑。"+
                    "\n"+
                    "\n"+
                    "球鞋测评: \n"+
                    "而在测试中 LeBron 16 在灵敏性方面确实提升了不是一点两点。\n" +
                    "最直观的是鞋帮的改变，将之前将鞋帮高度调整为较矮的设计，不管是进攻中的左右变向，还是防守中的侧向滑步，脚踝都不会受到鞋帮的阻碍，从而在运动中变的更加灵活。相比于 LeBron 14、LeBron 15，较低的鞋帮设计在穿脱方面也更加轻松。",

            "球鞋简介: \n"+
                    "ZOOM结构和上面两个都不一样，AIRMAX被划分成一个个区域空间，ZOOM是一个完整的气垫，里面充满了高弹性尼龙纤维，以热压方式固定在气垫的上下内壁。\n" +
                    "由于气垫内气压达到一定压力时，气体会向外膨胀，将尼龙纤维拉直，使其处于紧绷状态，当气垫受力时，尼龙纤维会被挤压弯曲，随即它会反弹回来，反作用力的支撑力。\n" +
                    "\n"+
                    "\n"+
                    "球鞋测评: \n"+
                    "这一代的中底及气垫的位置都进行了调整，可以理解飞马灵魂材料的大换血，在中底使用了在2018年推出的react泡棉，这可是nike 当年要拿来比肩阿迪boost材料。前掌内置zoom air  气垫！\n" +
                    "解决了鞋楦偏窄的问题！一双综合性比较高的跑鞋，可以慢跑 逛街，可以训练，也可以进行马拉松比赛。"
    };




    private int[] nikeMenuIcons = {
            R.drawable.lbj,R.drawable.kobe,
            R.drawable.irving,R.drawable.gtcut,
            R.drawable.lebron,R.drawable.zoomjpg
    };
    private String[] nikeMenuNames ={
            "LBJ14代","kobe5代",
            "Irving5代","GtCut",
            "LBj16代","NikeZoom"
    };

    public String[] getNikeTexts() {
        return nikeTexts;
    }

    public int[] getNikeMenuIcons() {
        return nikeMenuIcons;
    }

    public String[] getNikeMenuNames() {
        return nikeMenuNames;
    }
}
